app/controllers/identity/emails_controller.rb

  def update
    if @user.update(email: params[:email])
---
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "benidirifaouzi@gmail.com"], ["updated_at", "2023-06-28 14:45:17.723861"], ["id", 1]]