app/controllers/identity/email_verifications_controller.rb

  def show
    if @user.update(verified: true)
---
UPDATE "users" SET "verified" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["verified", true], ["updated_at", "2023-06-25 22:06:53.096617"], ["id", 23]]

  def create
    UserMailer.with(user: Current.user).email_verification.deliver_later
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]