app/controllers/identity/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."verified" = $2 LIMIT $3  [["email", "foofooamazigh@gmail.com"], ["verified", true], ["LIMIT", 1]]
---
  def create
    if @user = User.find_by(email: params[:email], verified: true)
      UserMailer.with(user: @user).password_reset.deliver_later

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_user
      token = PasswordResetToken.find_signed!(params[:sid]); @user = token.user

DELETE FROM "password_reset_tokens" WHERE "password_reset_tokens"."user_id" = $1  [["user_id", 2]]
---
    def revoke_tokens
      @user.password_reset_tokens.delete_all