app/controllers/book_reviews_controller.rb

SELECT "book_reviews"."id", "book_reviews"."user_id", "book_reviews"."user_username", "book_reviews"."review" FROM "book_reviews" WHERE "book_reviews"."book_id" = $1  [["book_id", "IJmdy8Er9EgC"]]
---
      def index
        book_id = params[:book_id]
        book_reviews = BookReview.where( book_id: book_id).pluck(:id, :user_id, :user_username, :review )

INSERT INTO "book_reviews" ("book_id", "user_id", "user_username", "review", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def create
        book_id = params[:book_id]
        user_id = Current.user.id
        user_username = Current.user.username
        book_review = params[:review]

        review = BookReview.create(user_id: user_id, book_id: book_id, user_username: user_username, review: book_review)

SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."id" = $1 LIMIT $2  [["id", 893], ["LIMIT", 1]]
DELETE FROM "book_reviews" WHERE "book_reviews"."id" = $1  [["id", 893]]
---
      def destroy
        review_id = params[:id]
        relation = BookReview.find_by(id: review_id)

        if relation
          relation.destroy