app/controllers/books_controller.rb

  def index
    user_id = Current.user.id
    book_ids = BookUserRelations.where(user_id: user_id).pluck(:book_id)
---
SELECT "book_user_relations"."book_id" FROM "book_user_relations" WHERE "book_user_relations"."user_id" = $1  [["user_id", 13]]

  def create
    book_id = request[:book_id]
    user_id = Current.user.id

    if BookUserRelations.exists?(user_id: user_id, book_id: book_id)
      render json: { error: "This book is already stored" }, status: :unprocessable_entity
    else
      BookUserRelations.create(user_id: user_id, book_id: book_id)
---
SELECT 1 AS one FROM "book_user_relations" WHERE "book_user_relations"."user_id" = $1 AND "book_user_relations"."book_id" = $2 LIMIT $3  [["user_id", 13], ["book_id", 13], ["LIMIT", 1]]
INSERT INTO "book_user_relations" ("user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 13], ["book_id", 13], ["created_at", "2023-06-24 23:55:43.463070"], ["updated_at", "2023-06-24 23:55:43.463070"]]

  def destroy
    user_id = Current.user.id
    book_id = params[:id]

    relation = BookUserRelations.find_by(user_id: user_id, book_id: book_id)
    if relation
      relation.destroy
---
SELECT "book_user_relations".* FROM "book_user_relations" WHERE "book_user_relations"."user_id" = $1 AND "book_user_relations"."book_id" = $2 LIMIT $3  [["user_id", 13], ["book_id", 16], ["LIMIT", 1]]
DELETE FROM "book_user_relations" WHERE "book_user_relations"."id" = $1  [["id", 2]]