app/controllers/passwords_controller.rb

  def update
    if !@user.authenticate(params[:current_password])
      render json: { error: "The current password you entered is incorrect" }, status: :bad_request
    elsif @user.update(user_params)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2023-06-28 22:12:22.482569"], ["id", 1]]