app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "verified", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
      if Current.user.update(user_params_update)
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "akvayli"], ["updated_at", "2023-06-28 13:59:56.809773"], ["id", 1]]