app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def set_session
      @session = Current.user.sessions.find(params[:id])